

var major = major || {};

major.colleges = {
	"0": "文學院",
	"1": "理學院",
	"2": "社會科學院",
	"3": "醫學院",
	"4": "工學院",
	"5": "農學院",
	"6": "管理學院",
	"7": "公共衛生學院",
	"8": "電機資訊學院",
	"9": "法律學院",
};

major.departments = {

	"001": "中國文學系",
	"002": "歷史學系",
	"003": "人類學系",
	"004": "日本語文學系",
	"005": "外文系",
	"006": "哲學系",
	"007": "圖資系",
	"008": "戲劇系",

	"101": "數學系",
	"102": "化學系",
	"103": "心理學系",
	"104": "大氣科學系",
	"105": "物理系",
	"106": "地質系",
	"107": "地理系",

	"201": "政治系",
	"202": "社會系",
	"203": "經濟系",
	"204": "社工系",

	"301": "醫學系",
	"302": "醫檢系",
	"303": "物治系",
	"304": "醫工系",
	"305": "牙醫系",
	"306": "藥學系",
	"307": "護理系",
	"308": "職治系",

	"401": "土木系",
	"402": "機械系",
	"403": "化工系",
	"404": "工科系",
	"405": "材料系",

	"501": "農藝系",
	"502": "農化系",
	"503": "環工系",
	"504": "植微系",
	"505": "森林系",
	"506": "動物科學系",
	"507": "農經系",
	"508": "園藝系",
	"509": "生機系",
	"510": "昆蟲系",
	"511": "獸醫系",

	"601": "工商管理學系",
	"602": "會計系",
	"603": "財金系",
	"604": "國企系",
	"605": "資管系",

	"701": "公衛系",

	"801": "電機工程學系",
	"802": "資訊工程學系",

	"901": "法律系",
};
